Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/E07B.tmx
Source language: en_us
Languages: zh_cn

source: Printed Party Flags
zh_cn: 自己动手印制派对彩旗

source: Create your own foam stamp and print some simple fabric flags to make party decor that's one-of-a-kind.
zh_cn: 创造一枚你自己的泡棉印章，并用它来印制一些简单的彩旗，作为你派对上独一无二、绝对个性的装饰品吧！

source: Sections
zh_cn: 步骤：

source: Make the stamp. Make the flags. Print the flags. Finish the banner.
zh_cn: 制作印章、缝制旗子、印制图案、完成彩旗

source: Tools
zh_cn: 工具：

source: Cutting mat, optional
zh_cn: 切割垫板（非必选）

source: Foam paintbrush, 1" wide
zh_cn: 泡棉笔刷（1寸宽刷头）

source: Point turner, optional
zh_cn: 剔角签（非必选）

source: Rotary cutter, optional
zh_cn: 辊式切割刀（非必选）

source: Ruler, quilting
zh_cn: 布艺用方眼定规尺

source: Scissors
zh_cn: 剪刀

source: Sewing machine
zh_cn: 缝纫机

source: X-Acto knife, optional
zh_cn: 美工刀（非必选）

source: Relevant parts
zh_cn: 相关配件

source: Fabric 1/4yd each of at least 4 different fabrics.
zh_cn: 1/4码见方、至少四种花色的布料。

source: Use as many as you like; a mix of prints and solids makes a nice banner.
zh_cn: 花色多少凭个人喜好；图案和花色越丰富，制作出的彩旗带越漂亮。

source: Thread
zh_cn: 斜纹线

source: Bias tape (3 yds) extra-wide double-fold bias tape, 1/2" wide.
zh_cn: 3码长、1/2寸宽斜纹线、对折。

source: Wood block, 5"x7" You can use scraps or find this in the unfinished wood section of the craft store.
zh_cn: 木块（5寸x七寸），你可以用手工店用剩下的木料。

source: Craft foam, 9"x12"
zh_cn: 泡棉块（9寸x12寸）

source: Glue Perfect Glue Formula 1.
zh_cn: 胶水（类似“哥俩好”这种胶水）

source: Paint Acrylic paint in desired colors.
zh_cn: 用你喜欢的丙烯颜料为图案上色。

source: If you plan on washing the banner, use fabric paint such as Jacquard Textile Color and be sure to set it when you're finished printing.
zh_cn: 如果你想清洗旗子，你可以用织物涂料比如提花织物染料（Jacquard Textile Color），并确保颜色固定在布片上。

source: Otherwise, cheaper acrylic paint is fine.
zh_cn: 如果不打算清洗，更便宜的丙烯颜料正合适。

source: Step 1 -- Make the stamp.
zh_cn: 步骤一——制作印章

source: Print the cupcake template available for download under Files above.
zh_cn: 把从网上下载的杯形蛋糕图案打印出来。

source: Place the paper template over the foam sheet and cut out each shape.
zh_cn: 将图案盖在一块薄的泡棉板上，按照模板剪出每一块的形状。

source: For the candle, first cut the outer shape, then cut out the inside. You may want to use an X-Acto knife for this step.
zh_cn: 蛋糕上蜡烛的图案，首先剪出外形，再用刻刀刻内图案。

source: Glue the foam shapes to the wood block and allow them to cure for at least 1 hour.
zh_cn: 用胶水，把剪出的泡棉图案站在木板上，待到一小时后胶水彻底凝固。

source: While you let the stamp cure, continue on to the fabric flags.
zh_cn: 在这期间，你可以继续之后的步骤。

source: Step 2 -- Make the flags.
zh_cn: 步骤二——缝制旗子

source: Cut twelve 11"¡Á8" rectangles of fabric.
zh_cn: 剪裁出12块11寸x8寸的长方形布片。

source: Fold each rectangle in half lengthwise with right sides together and press.
zh_cn: 将每一块布片纵向对折，压平。

source: Stitch around 1 short and 1 long side of each flag using a 1/2" seam.
zh_cn: 将对折好的布片，沿一条短边、一条长边缝合，缝合线和布边留有1/2寸的距离。

source: Trim the seam allowance to 1/4", clip the corners close to the edge, and turn each flag right side out.
zh_cn: 用剪刀将预留出来的布边修剪至1/4寸宽，边角处修剪得更靠近缝合线，将缝好的旗子反过来。

source: Use a point turner if you have one to help turn out the corners.
zh_cn: 如果你在处理边角使遇到困难，可以借助剔角签的力量。

source: Step 3 -- Print the flags.
zh_cn: 步骤三——印制图案

source: To make printing easier, decide which color of paint to use for each flag and group them accordingly.
zh_cn: 为了简化印制步骤，首先决定好每个旗子分别要用的颜色，再将它们依次分组。

source: You may want to slide a piece of cardboard inside each flag as you print it to make sure the paint won't bleed through, and it's a good idea to practice on some scraps first to get the best results.
zh_cn: 你可以在每个旗子内部装一张硬纸卡，以防染色时颜色渗到背面去。在真正开始之前你可以找几块废布先练习一下,以便获得最好效果。

source: Starting with the lightest color, apply a coat of paint to the stamp with the foam brush. Center the stamp over a flag and press it down for 10 seconds. Remove the stamp to reveal your print!
zh_cn: 先涂浅颜色，用泡棉笔刷将颜料涂在印章表面，印章印在旗子正中心，按压10秒钟，移开印章就可以完成图案啦。

source: Reapply paint between each stamping for best results.
zh_cn: 每次印图案之前再刷一遍颜色，以便获得最好效果。

source: Make sure there's no paint clumped on the sides of the foam, or you may end up with a gloppy print.
zh_cn: 上色时务必确保泡棉印章边缘的清洁，否则你印出的图案就会变成黏糊糊的一团了。

source: To change colors, rinse the stamp under running water and rub away the excess paint.
zh_cn: 更换颜色时，将印章在流水下冲洗干净，擦除残留的颜料。

source: Stamp the rinsed stamp onto a folded paper towel until it comes out clean.
zh_cn: 将印章反复在一张折叠好的纸巾上按压，直到颜料清除。

source: Make sure the stamp is dry before applying the next color of paint.
zh_cn: 在涂下一个颜色之前，印章必须是干燥的。

source: Use a clean foam brush to apply the next color.
zh_cn: 用干净的泡棉笔刷涂色。

source: Repeat for as many colors as desired.
zh_cn: 其他颜色也是这样涂。

source: Let the flags dry. If you're using fabric paint, heat-set the stamped designs according to the paint instructions.
zh_cn: 将旗子晾干，如果你用的是织物涂料，可根据印染说明，进行加热，固定颜色。

source: Step 4 -- Finish the banner.
zh_cn: 步骤四——完成彩旗

source: Press the bias tape to straighten any creases resulting from packaging.
zh_cn: 将包装时在斜纹带上留下的褶皱压平。

source: Lay out the bias tape with the wider fold on the bottom side.
zh_cn: 斜纹带不对称对折，一边宽，一边窄。

source: Arrange all 12 flags along the length of the tape, leaving about 3 1/4" of tape between each flag and about 6" of tape at the ends. Slide each flag into place between the folds of the tape's open edge and pin in place.
zh_cn: 在宽的一边压上旗子，再将窄的一边折过来盖住旗子，然后用针别住固定。每个旗子的间隔为3 1/4寸，在旗带两端预留出6寸长。

source: Sew a straight stitch along the open edge of the tape, being sure to encase each flag as you go.
zh_cn: 沿对折后斜纹带的开口边缝纫，确保每个彩旗都被匝进去。

source: Fold back 1" at each end of the bias tape. Sew the short edge to the backside of the tape to form a hanging loop.
zh_cn: 在之前预留出的两端旗带上，折回约一寸长，缝住短头，做一个挂圈。

source: Hang the banner as desired.
zh_cn: 最后把彩旗挂在你想挂的地方吧！
